-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Apr 11, 2023 at 03:52 PM
-- Server version: 10.4.27-MariaDB
-- PHP Version: 8.2.0

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `final_project`
--

-- --------------------------------------------------------

--
-- Table structure for table `medal_table`
--

CREATE TABLE `medal_table` (
  `Team` varchar(50) NOT NULL,
  `Gold` int(50) NOT NULL,
  `Silver` int(50) NOT NULL,
  `Bronze` int(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `medal_table`
--

INSERT INTO `medal_table` (`Team`, `Gold`, `Silver`, `Bronze`) VALUES
('แดง', 5, 3, 3),
('ฟ้า', 4, 2, 6),
('เขียว', 2, 5, 1),
('ม่วง', 1, 4, 1);

-- --------------------------------------------------------

--
-- Table structure for table `name_list`
--

CREATE TABLE `name_list` (
  `ID` int(100) NOT NULL,
  `Title` varchar(100) NOT NULL,
  `Name` varchar(100) NOT NULL,
  `Lastname` varchar(100) NOT NULL,
  `Department` varchar(100) NOT NULL,
  `Team` varchar(100) NOT NULL,
  `Sport` varchar(100) NOT NULL,
  `Date` varchar(100) NOT NULL,
  `Time` varchar(100) NOT NULL,
  `Place` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `name_list`
--

INSERT INTO `name_list` (`ID`, `Title`, `Name`, `Lastname`, `Department`, `Team`, `Sport`, `Date`, `Time`, `Place`) VALUES
(1, 'นาย', 'เจริญ', 'นามสีฐาน', 'สาขาวิชาวิศวกรรมโยธา', 'สีแดง', 'ฟุตบอล', '01/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(2, 'นาย', 'ชัยยา', 'คำสมน้อย', 'สาขาวิชาวิศวกรรมโยธา', 'สีแดง', 'ฟุตบอล', '01/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(3, 'นาย', 'มานพ', 'เจริญกุล', 'สาขาวิชาวิศวกรรมโยธา', 'สีแดง', 'ฟุตบอล', '01/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(4, 'นาย', 'ประดิษฐ์', 'กาบจันทร์', 'สาขาวิชาวิศวกรรมโยธา', 'สีแดง', 'ฟุตบอล', '01/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(5, 'นางสาว', 'พัชรี', 'นิมา', 'สาขาวิชาวิศวกรรมโยธา', 'สีแดง', 'ฟุตบอล', '01/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(6, 'นาย', 'พิทักษ์', 'นามสิงห์ขันธ์', 'สาขาวิชาวิศวกรรมโยธา', 'สีแดง', 'ฟุตบอล', '01/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(7, 'นาย', 'สกลเกียรติ', 'กวีพิชชาพัชร', 'สาขาวิชาวิศวกรรมโยธา', 'สีแดง', 'ฟุตบอล', '01/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(8, 'นาย', 'ปองพล', 'อ่อนขาว', 'สาขาวิชาวิศวกรรมโยธา', 'สีแดง', 'ฟุตบอล', '01/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(9, 'ว่าที่ ร.ต.', 'ปิยณัฐ', 'จันโทสุทธิ์', 'สาขาวิชาวิศวกรรมโยธา', 'สีแดง', 'ฟุตบอล', '01/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(10, 'นาย', 'ตรรกวิทย์', 'คำก้อน', 'สาขาวิชาวิศวกรรมโยธา', 'สีแดง', 'ฟุตบอล', '01/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(11, 'นาย', 'พรหมมินทร์ ', 'เถาวัลย์ดี', 'สาขาวิชาวิศวกรรมโยธา', 'สีแดง', 'ฟุตบอล', '01/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(12, 'นาย', 'สุวัฒน์', 'บุญทศ', 'สาขาวิชาวิศวกรรมไฟฟ้า', 'สีแดง', 'ฟุตบอล', '01/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(13, 'นาย', 'ภควัต', 'ศรีจารุเดช', 'สาขาวิชาวิศวกรรมไฟฟ้า', 'สีแดง', 'ฟุตบอล', '01/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(14, 'นาย', 'ประเวทย์', 'พรหมจิตรานนท์', 'สาขาวิชาวิศวกรรมเกษตร', 'สีแดง', 'ฟุตบอล', '01/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(15, 'นาย', 'จักรพันธ์', 'ด้วงคำจันทร์', 'สาขาวิชาวิศวกรรมเกษตร', 'สีแดง', 'ฟุตบอล', '01/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(16, 'นาย', 'ภาณุวัฒน์', 'ลาดลงเมือง', 'สาขาวิชาวิศวกรรมเกษตร', 'สีแดง', 'ฟุตบอล', '01/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(17, 'นาย', 'สมชาย', 'แก้วบุญเรือง', 'สาขาวิชาวิศวกรรมอุตสาหการ', 'สีแดง', 'ฟุตบอล', '01/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(18, 'นาย', 'กองพัน', 'คุ้มไข่น้ำ', 'สาขาวิชาวิศวกรรมอุตสาหการ', 'สีแดง', 'ฟุตบอล', '01/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(19, 'นาย', 'สิงห์ทอง', 'พรมโสดา', 'สาขาวิชาวิศวกรรมอุตสาหการ', 'สีแดง', 'ฟุตบอล', '01/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(20, 'นาย', 'มานพ', 'ลีใส', 'สาขาวิชาวิศวกรรมอุตสาหการ', 'สีแดง', 'ฟุตบอล', '01/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(21, 'นาย', 'บวรกิตติ์', 'พันธ์เสถียร', 'สาขาวิชาวิศวกรรมอุตสาหการ', 'สีแดง', 'ฟุตบอล', '01/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(22, 'นาย', 'ธีระเวทย์ ', 'พระชัย', 'สาขาวิชาวิศวกรรมอุตสาหการ', 'สีแดง', 'วอลเล่บอล', '02/04/23', '15:00 - 17:00', 'โรงยิม'),
(23, 'นาย', 'วีระสุนทร', 'เคนกา', 'สาขาวิชาวิศวกรรมอุตสาหการ', 'สีแดง', 'วอลเล่บอล', '02/04/23', '15:00 - 17:00', 'โรงยิม'),
(24, 'นาย', 'โกวิทย์', 'พลหาญ', 'สาขาวิชาวิศวกรรมอุตสาหการ', 'สีแดง', 'วอลเล่บอล', '02/04/23', '15:00 - 17:00', 'โรงยิม'),
(25, 'นาย', 'อาทิตย์', 'ยั่งยืน', 'สาขาวิชาวิศวกรรมอุตสาหการ', 'สีแดง', 'วอลเล่บอล', '02/04/23', '15:00 - 17:00', 'โรงยิม'),
(26, 'นาย', 'พงษ์พันธ์', 'ขยันเยี่ยม', 'สาขาวิชาวิศวกรรมเครื่องกล', 'สีแดง', 'วอลเล่บอล', '02/04/23', '15:00 - 17:00', 'โรงยิม'),
(27, 'นาย', 'ศุภชัย', 'สมบัติหา', 'สาขาวิชาวิศวกรรมเครื่องกล', 'สีแดง', 'วอลเล่บอล', '02/04/23', '15:00 - 17:00', 'โรงยิม'),
(28, 'นาย', 'จักร์พล', 'ศรีกลชาญ', 'สาขาวิชาวิศวกรรมเครื่องกล', 'สีแดง', 'วอลเล่บอล', '02/04/23', '15:00 - 17:00', 'โรงยิม'),
(29, 'นาย', 'ครรชิต', 'จันทร์โท', 'สาขาวิชาวิศวกรรมเครื่องกล', 'สีแดง', 'วอลเล่บอล', '02/04/23', '15:00 - 17:00', 'โรงยิม'),
(30, 'นาย', 'นารถพงศ์', 'พระชัย', 'สาขาวิชาวิศวกรรมเครื่องกล', 'สีแดง', 'วอลเล่บอล', '02/04/23', '15:00 - 17:00', 'โรงยิม'),
(31, 'นาง', 'ไพศรี', 'วรรณแสงทอง', 'สาขาวิชาวิศวกรรมสิ่งแวดล้อม', 'สีแดง', 'วอลเล่บอล', '02/04/23', '15:00 - 17:00', 'โรงยิม'),
(32, 'นางสาว', 'กฤษณา', 'โพธิ์ศรีขาม', 'สาขาวิชาวิศวกรรมสิ่งแวดล้อม', 'สีแดง', 'วอลเล่บอล', '02/04/23', '15:00 - 17:00', 'โรงยิม'),
(33, 'นาย', 'สิทธิพันธุ์', 'สายบุญลี', 'สาขาวิชาวิศวกรรมสิ่งแวดล้อม', 'สีแดง', 'วอลเล่บอล', '02/04/23', '15:00 - 17:00', 'โรงยิม'),
(34, 'นางสาว', 'จีรนันท์', 'จุทอง', 'สาขาวิชาวิศวกรรมสิ่งแวดล้อม', 'สีแดง', 'วอลเล่บอล', '02/04/23', '15:00 - 17:00', 'โรงยิม'),
(35, 'นาย', 'บรรชา', 'สุภาวงศ์', 'สาขาวิชาวิศวกรรมเคมี', 'สีแดง', 'วอลเล่บอล', '02/04/23', '15:00 - 17:00', 'โรงยิม'),
(36, 'นาย', 'เกรียงไกร', 'ไตรคุ้มกัน', 'สาขาวิชาวิศวกรรมเคมี', 'สีแดง', 'วอลเล่บอล', '02/04/23', '15:00 - 17:00', 'โรงยิม'),
(37, 'นางสาว', 'วิมลพร', 'เอี่ยมอมรพันธ์', 'สาขาวิชาวิศวกรรมเคมี', 'สีแดง', 'ปิงปอง', '01/04/23', '15:00 - 16:00', 'สนามปิงปอง'),
(38, 'นาย', 'อนุชา', 'ไชยนิฮม', 'สาขาวิชาวิศวกรรมเคมี', 'สีแดง', 'ปิงปอง', '01/04/23', '15:00 - 16:00', 'สนามปิงปอง'),
(39, 'นาย', 'นิระ', 'หมื่นภูเขียว', 'สาขาวิชาวิศวกรรมคอมพิวเตอร์', 'สีแดง', 'ปิงปอง', '01/04/23', '15:00 - 16:00', 'สนามปิงปอง'),
(40, 'นาย', 'ธีรพงษ์', 'บุญพา', 'สาขาวิชาวิศวกรรมคอมพิวเตอร์', 'สีแดง', 'ปิงปอง', '01/04/23', '15:00 - 16:00', 'สนามปิงปอง'),
(41, 'นาง', 'กรรณิการ์', 'เรืองศรีวิรัตน์', 'สาขาวิชาวิศวกรรมสิ่งแวดล้อม', 'สีแดง', 'ปิงปอง', '01/04/23', '15:00 - 16:00', 'สนามปิงปอง'),
(42, 'นาง', 'เสาวรภย์', 'เจริญกุล', 'สาขาวิชาวิศวกรรมเกษตร', 'สีเขียว', 'ฟุตบอล', '02/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(43, 'นาง', 'นภา ', 'อาษารัฐ', 'กองบริหารงานคณะ', 'สีเขียว', 'ฟุตบอล', '02/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(44, 'นาง', 'จีระนันท์', 'พลยางนอก', 'กองบริหารงานคณะ', 'สีเขียว', 'ฟุตบอล', '02/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(45, 'นาง', 'อรวรรณ', 'แก่นเชียงสา', 'กองบริหารงานคณะ', 'สีเขียว', 'ฟุตบอล', '02/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(46, 'นาง', 'มยุรี', 'ยงกำลัง', 'กองบริหารงานคณะ', 'สีเขียว', 'ฟุตบอล', '02/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(47, 'นาง', 'ธิดาสวรรค์', 'สิทธิเราะ', 'กองบริหารงานคณะ', 'สีเขียว', 'ฟุตบอล', '02/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(48, 'นาย', 'ธนพล', 'รังสิมานพ', 'กองบริหารงานคณะ', 'สีเขียว', 'ฟุตบอล', '02/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(49, 'นาย', 'สุพัฒน์', 'ศรีพุทธา', 'กองบริหารงานคณะ', 'สีเขียว', 'ฟุตบอล', '02/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(50, 'นาย', 'สุขุม', 'ดวงเพียอ้ม', 'กองบริหารงานคณะ', 'สีเขียว', 'ฟุตบอล', '02/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(51, 'นาย', 'เบ็ญ', 'โคตรทุม', 'กองบริหารงานคณะ', 'สีเขียว', 'ฟุตบอล', '02/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(52, 'นาง', 'นวพร', 'อินทร์อร่ามวงษ์', 'กองบริหารงานคณะ', 'สีเขียว', 'ฟุตบอล', '02/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(53, 'นาง', 'พูนสิน', 'คำพิบูลย์', 'กองบริหารงานคณะ', 'สีเขียว', 'ฟุตบอล', '02/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(54, 'นาง', 'สุทธดา', 'ทรงจอหอ', 'สาขาวิชาวิศวกรรมเคมี', 'สีเขียว', 'ฟุตบอล', '02/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(55, 'นาย', 'เทียนชัย', 'ภูคณะ', 'กองบริหารงานคณะ', 'สีเขียว', 'ฟุตบอล', '02/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(56, 'นาง', 'คำภา', 'วงษ์คำอุด', 'สาขาวิชาวิศวกรรมไฟฟ้า', 'สีเขียว', 'ฟุตบอล', '02/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(57, 'นาง', 'นงเยาว์', 'ทองเมืองน้อย', 'กองบริหารงานคณะ', 'สีเขียว', 'ฟุตบอล', '02/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(58, 'นาง', 'โสภา', 'ภักดี', 'กองบริหารงานคณะ', 'สีเขียว', 'ฟุตบอล', '02/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(59, 'นาง', 'ลัดดาวัลย์', 'กำไรงาม', 'กองบริหารงานคณะ', 'สีเขียว', 'ฟุตบอล', '02/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(60, 'นาง', 'ลัดดาวัลย์', 'กำไรงาม', 'กองบริหารงานคณะ', 'สีเขียว', 'ฟุตบอล', '02/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(61, 'นาง', 'ปรีชญา', 'จันทรประทักษ์', 'กองบริหารงานคณะ', 'สีเขียว', 'ฟุตบอล', '02/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(62, 'นางสาว', 'พรรณี', 'พันบุรี', 'กองบริหารงานคณะ', 'สีเขียว', 'ฟุตบอล', '02/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(63, 'นางสาว', 'กัญญณัท', 'วรศรี', 'กองบริหารงานคณะ', 'สีเขียว', 'วอลเล่บอล', '01/04/23', '15:00 - 17:00', 'โรงยิม'),
(64, 'นาง', 'บุญส่ง', 'ชมทรัพย์เจริญ', 'สาขาวิชาวิศวกรรมไฟฟ้า', 'สีเขียว', 'วอลเล่บอล', '01/04/23', '15:00 - 17:00', 'โรงยิม'),
(65, 'นาง', 'วิไลพร', 'ชมภูเขียว', 'กองบริหารงานคณะ', 'สีเขียว', 'วอลเล่บอล', '01/04/23', '15:00 - 17:00', 'โรงยิม'),
(66, 'นาง', 'สุมนา', 'เยาวมาตย์', 'กองบริหารงานคณะ', 'สีเขียว', 'วอลเล่บอล', '01/04/23', '15:00 - 17:00', 'โรงยิม'),
(67, 'นาง', 'นุชจะรินทร์', 'ตาดี', 'กองบริหารงานคณะ', 'สีเขียว', 'วอลเล่บอล', '01/04/23', '15:00 - 17:00', 'โรงยิม'),
(68, 'นาง', 'นวพร', 'ก้อนจันทร์', 'กองบริหารงานคณะ', 'สีเขียว', 'วอลเล่บอล', '01/04/23', '15:00 - 17:00', 'โรงยิม'),
(69, 'นาย', 'ธัมรงค์', 'กิจโป้', 'กองบริหารงานคณะ', 'สีเขียว', 'วอลเล่บอล', '01/04/23', '15:00 - 17:00', 'โรงยิม'),
(70, 'นาย', 'ไว', 'บุตรพิเศษ', 'กองบริหารงานคณะ', 'สีเขียว', 'วอลเล่บอล', '01/04/23', '15:00 - 17:00', 'โรงยิม'),
(71, 'นาง', 'เสริมสุข', 'วิสุทธิญาณภิรมย์', 'กองบริหารงานคณะ', 'สีเขียว', 'วอลเล่บอล', '01/04/23', '15:00 - 17:00', 'โรงยิม'),
(72, 'นาย', 'รุ่งอรุณ', 'จันทมาตย์', 'กองบริหารงานคณะ', 'สีเขียว', 'วอลเล่บอล', '01/04/23', '15:00 - 17:00', 'โรงยิม'),
(73, 'นาง', 'สุวิมล', 'กล่อมวงศ์', 'กองบริหารงานคณะ', 'สีเขียว', 'วอลเล่บอล', '01/04/23', '15:00 - 17:00', 'โรงยิม'),
(74, 'นาง', 'ประพรรณวดี', 'ปราชญ์กุลวงศ์', 'กองบริหารงานคณะ', 'สีเขียว', 'วอลเล่บอล', '01/04/23', '15:00 - 17:00', 'โรงยิม'),
(75, 'นาง', 'อนุรักษ์', 'ใยแก้ว', 'กองบริหารงานคณะ', 'สีเขียว', 'วอลเล่บอล', '01/04/23', '15:00 - 17:00', 'โรงยิม'),
(76, 'นาย', 'มนตรี', 'พันเดช', 'กองบริหารงานคณะ', 'สีเขียว', 'วอลเล่บอล', '01/04/23', '15:00 - 17:00', 'โรงยิม'),
(77, 'นาง', 'อำพร', 'นามสีฐาน', 'กองบริหารงานคณะ', 'สีเขียว', 'วอลเล่บอล', '01/04/23', '15:00 - 17:00', 'โรงยิม'),
(78, 'นาง', 'ยุพิน', 'พานิชย์พะเนาว์', 'กองบริหารงานคณะ', 'สีเขียว', 'ปิงปอง', '01/04/23', '15:00 - 16:00', 'สนามปิงปอง'),
(79, 'นาง', 'ปัทมา', 'กาญจนพัฒน์', 'สาขาวิชาวิศวกรรมสิ่งแวดล้อม', 'สีเขียว', 'ปิงปอง', '01/04/23', '15:00 - 16:00', 'สนามปิงปอง'),
(80, 'นาย', 'บุญทัน', 'ขันอาสา', 'กองบริหารงานคณะ', 'สีเขียว', 'ปิงปอง', '01/04/23', '15:00 - 16:00', 'สนามปิงปอง'),
(81, 'นาง', 'สมจิตร', 'ยามี', 'กองบริหารงานคณะ', 'สีเขียว', 'ปิงปอง', '01/04/23', '15:00 - 16:00', 'สนามปิงปอง'),
(82, 'นาย', 'สุรทิน', 'วงษ์ดวง', 'กองบริหารงานคณะ', 'สีเขียว', 'ปิงปอง', '01/04/23', '15:00 - 16:00', 'สนามปิงปอง'),
(83, 'นางสาว', 'นิภาภรณ์', 'บุษราคัม', 'กองบริหารงานคณะ', 'สีฟ้า', 'ฟุตบอล', '01/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(84, 'นางสาว', 'สุคนธ์ทิพย์', 'สื่อเกียรติก้อง', 'กองบริหารงานคณะ', 'สีฟ้า', 'ฟุตบอล', '01/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(85, 'นาย', 'สมพงษ์', 'บัวคำภา', 'กองบริหารงานคณะ', 'สีฟ้า', 'ฟุตบอล', '01/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(86, 'นางสาว', 'อรวรรณ', 'ชินทะนาม', 'กองบริหารงานคณะ', 'สีฟ้า', 'ฟุตบอล', '01/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(87, 'นาง', 'สุพิน', 'มูลอาษา', 'กองบริหารงานคณะ', 'สีฟ้า', 'ฟุตบอล', '01/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(88, 'นางสาว', 'วริฐา', 'ทองเหง้า', 'สาขาวิชาวิศวกรรมเกษตร', 'สีฟ้า', 'ฟุตบอล', '01/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(89, 'นาย', 'คำปน', 'ซาซุม', 'กองบริหารงานคณะ', 'สีฟ้า', 'ฟุตบอล', '01/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(90, 'นาง', 'ธรธัญญา', 'ธารเลิศ', 'สาขาวิชาวิศวกรรมเครื่องกล', 'สีฟ้า', 'ฟุตบอล', '01/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(91, 'นางสาว', 'สุกัญญา', 'วรรณสิทธิ์', 'กองบริหารงานคณะ', 'สีฟ้า', 'ฟุตบอล', '01/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(92, 'นางสาว', 'จตุพร', 'พิทักษ์พลรัตน์', 'กองบริหารงานคณะ', 'สีฟ้า', 'ฟุตบอล', '01/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(93, 'นาย', 'สาธร', 'พลศักดิ์', 'กองบริหารงานคณะ', 'สีฟ้า', 'ฟุตบอล', '01/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(94, 'นางสาว', 'ณัฐพัชร', 'แสงนิรันดร์', 'กองบริหารงานคณะ', 'สีฟ้า', 'ฟุตบอล', '01/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(95, 'นางสาว', 'อารีย์วรรณ', 'ละม้ายพันธ์', 'กองบริหารงานคณะ', 'สีฟ้า', 'ฟุตบอล', '01/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(96, 'นาง', 'อภิญญา', 'พันธ์สวัสดิ์', 'กองบริหารงานคณะ', 'สีฟ้า', 'ฟุตบอล', '01/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(97, 'นาง', 'ธนธรณ์', 'เพียดสิงห์', 'กองบริหารงานคณะ', 'สีฟ้า', 'ฟุตบอล', '01/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(98, 'นางสาว', 'บุษราภรณ์', 'อินทร์ตาแสง', 'กองบริหารงานคณะ', 'สีฟ้า', 'ฟุตบอล', '01/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(99, 'นาง', 'สุนีย์', 'เพียจันทร์', 'กองบริหารงานคณะ', 'สีฟ้า', 'ฟุตบอล', '01/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(100, 'นางสาว', 'พัชราพร', 'ด่านธนธรณ์', 'กองบริหารงานคณะ', 'สีฟ้า', 'ฟุตบอล', '01/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(101, 'นางสาว', 'อรชร', 'สอนสะอาด', 'กองบริหารงานคณะ', 'สีฟ้า', 'ฟุตบอล', '01/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(102, 'นาย', 'สุรวุฒิ', 'สุพร', 'กองบริหารงานคณะ', 'สีฟ้า', 'ฟุตบอล', '01/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(103, 'นางสาว', 'ทิพากร', 'ชัยสงค์', 'กองบริหารงานคณะ', 'สีฟ้า', 'วอลเล่บอล', '01/04/23', '15:00 - 17:00', 'โรงยิม'),
(104, 'นางสาว', 'จารุณี', 'นวลบุญมา', 'กองบริหารงานคณะ', 'สีฟ้า', 'วอลเล่บอล', '01/04/23', '15:00 - 17:00', 'โรงยิม'),
(105, 'นาย', 'วงศกร', 'วารินทร์กุต', 'กองบริหารงานคณะ', 'สีฟ้า', 'วอลเล่บอล', '01/04/23', '15:00 - 17:00', 'โรงยิม'),
(106, 'นาย', 'อาทิตย์', 'นรปติ', 'กองบริหารงานคณะ', 'สีฟ้า', 'วอลเล่บอล', '01/04/23', '15:00 - 17:00', 'โรงยิม'),
(107, 'นางสาว', 'สุวรรณี', 'มังดินดำ', 'กองบริหารงานคณะ', 'สีฟ้า', 'วอลเล่บอล', '01/04/23', '15:00 - 17:00', 'โรงยิม'),
(108, 'นาง', 'บัวไข', 'สังข์ปรีชา', 'กองบริหารงานคณะ', 'สีฟ้า', 'วอลเล่บอล', '01/04/23', '15:00 - 17:00', 'โรงยิม'),
(109, 'นางสาว', 'หนูเพียร', 'ปักนอก', 'กองบริหารงานคณะ', 'สีฟ้า', 'วอลเล่บอล', '01/04/23', '15:00 - 17:00', 'โรงยิม'),
(110, 'นาย', 'ประวิทย์', 'ศรีวงษา', 'กองบริหารงานคณะ', 'สีฟ้า', 'วอลเล่บอล', '01/04/23', '15:00 - 17:00', 'โรงยิม'),
(111, 'นาย', 'ภาณุพงศ์', 'ต.ประเสริฐ', 'กองบริหารงานคณะ', 'สีฟ้า', 'วอลเล่บอล', '01/04/23', '15:00 - 17:00', 'โรงยิม'),
(112, 'นางสาว', 'ลัดดาภรณ์', 'อินตาหามแห', 'กองบริหารงานคณะ', 'สีฟ้า', 'วอลเล่บอล', '01/04/23', '15:00 - 17:00', 'โรงยิม'),
(113, 'นาย', 'ทรงวุฒิ', 'หิรัญมาพร', 'กองบริหารงานคณะ', 'สีฟ้า', 'วอลเล่บอล', '01/04/23', '15:00 - 17:00', 'โรงยิม'),
(114, 'นางสาว', 'เสาร์', 'นามสีฐาน', 'กองบริหารงานคณะ', 'สีฟ้า', 'วอลเล่บอล', '01/04/23', '15:00 - 17:00', 'โรงยิม'),
(115, 'นางสาว', 'สมร', 'กรมรัฐ', 'กองบริหารงานคณะ', 'สีฟ้า', 'วอลเล่บอล', '01/04/23', '15:00 - 17:00', 'โรงยิม'),
(116, 'นาง', 'เตียนใจ', 'แสงอุทัย', 'กองบริหารงานคณะ', 'สีฟ้า', 'วอลเล่บอล', '01/04/23', '15:00 - 17:00', 'โรงยิม'),
(117, 'นาง', 'รัศมี', 'เจริญกุล', 'กองบริหารงานคณะ', 'สีฟ้า', 'วอลเล่บอล', '01/04/23', '15:00 - 17:00', 'โรงยิม'),
(118, 'นาง', 'บัวพันธ์', 'แก่นหามูล', 'กองบริหารงานคณะ', 'สีฟ้า', 'ปิงปอง', '02/04/23', '15:00 - 16:00', 'สนามปิงปอง'),
(119, 'นางสาว', 'จิระพร', 'บุญมา', 'กองบริหารงานคณะ', 'สีฟ้า', 'ปิงปอง', '02/04/23', '15:00 - 16:00', 'สนามปิงปอง'),
(120, 'นาง', 'สุกัญญา', 'เกิดศิลป์', 'กองบริหารงานคณะ', 'สีฟ้า', 'ปิงปอง', '02/04/23', '15:00 - 16:00', 'สนามปิงปอง'),
(121, 'นาย', 'สงคราม', 'มีเศษ', 'กองบริหารงานคณะ', 'สีฟ้า', 'ปิงปอง', '02/04/23', '15:00 - 16:00', 'สนามปิงปอง'),
(122, 'นางสาว', 'สุวรรณา', 'สีนาเพียง', 'กองบริหารงานคณะ', 'สีฟ้า', 'ปิงปอง', '02/04/23', '15:00 - 16:00', 'สนามปิงปอง'),
(123, 'นางสาว', 'เต็มศิริ', 'เชื้อเอี่ยมพันธ์', 'กองบริหารงานคณะ', 'สีม่วง', 'ฟุตบอล', '02/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(124, 'นางสาว', 'สุกัญญา', 'คำมูล', 'กองบริหารงานคณะ', 'สีม่วง', 'ฟุตบอล', '02/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(125, 'นาย', 'ธนากร', 'ตั้งจิตประสงค์', 'กองบริหารงานคณะ', 'สีม่วง', 'ฟุตบอล', '02/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(126, 'นางสาว', 'เสาวนา', 'เสียงสนั่น', 'สาขาวิชาวิศวกรรมโยธา', 'สีม่วง', 'ฟุตบอล', '02/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(127, 'นาย', 'กริช', 'ผาบจันทร์สิงห์', 'กองบริหารงานคณะ', 'สีม่วง', 'ฟุตบอล', '02/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(128, 'นาง', 'ปรานี', 'ธรรมจินดา', 'กองบริหารงานคณะ', 'สีม่วง', 'ฟุตบอล', '02/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(129, 'นางสาว', 'บุตรตรี', 'คนซื่อ', 'กองบริหารงานคณะ', 'สีม่วง', 'ฟุตบอล', '02/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(130, 'นาย', 'สมพร', 'จันทร์โสม', 'กองบริหารงานคณะ', 'สีม่วง', 'ฟุตบอล', '02/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(131, 'นาย', 'สมใจ', 'ขันอาสา', 'กองบริหารงานคณะ', 'สีม่วง', 'ฟุตบอล', '02/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(132, 'นางสาว', 'พัชราภรณ์ ', 'เสนาศูนย์', 'กองบริหารงานคณะ', 'สีม่วง', 'ฟุตบอล', '02/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(133, 'นางสาว', 'ธิตา', 'พีรพลพัฒน์พงษ์', 'สาขาวิชาวิศวกรรมอุตสาหการ', 'สีม่วง', 'ฟุตบอล', '02/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(134, 'นางสาว', 'นันทิดา', 'โนนสว่าง', 'สาขาวิชาวิศวกรรมคอมพิเตอร์', 'สีม่วง', 'ฟุตบอล', '02/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(135, 'นางสาว', 'วราพร', 'ศรีไพร', 'สาขาวิชาวิศวกรรมเครื่องกล', 'สีม่วง', 'ฟุตบอล', '02/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(136, 'นาย', 'นครินทร์', 'พูลศรี', 'กองบริหารงานคณะ', 'สีม่วง', 'ฟุตบอล', '02/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(137, 'นาย', 'มานะชัย', 'สอนเพ็ง', 'กองบริหารงานคณะ', 'สีม่วง', 'ฟุตบอล', '02/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(138, 'นาย', 'วิทยา', 'ศิริสาร', 'กองบริหารงานคณะ', 'สีม่วง', 'ฟุตบอล', '02/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(139, 'นาง', 'ลำพรรณ์', 'ดีรักษา', 'กองบริหารงานคณะ', 'สีม่วง', 'ฟุตบอล', '02/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(140, 'นางสาว', 'จานิพร', 'ทะเสนฮด', 'สาขาวิชาวิศวกรรมคอมพิวเตอร์', 'สีม่วง', 'ฟุตบอล', '02/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(141, 'นาย', 'ธีรฉัตร', 'อนิวรรตเมธี', 'กองบริหารงานคณะ', 'สีม่วง', 'ฟุตบอล', '02/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(142, 'นาง', 'ลำใย', 'คำจำปา', 'กองบริหารงานคณะ', 'สีม่วง', 'ฟุตบอล', '02/04/23', '15:00 - 17:00', 'สนามฟุตบอล'),
(143, 'นางสาว', 'นิตย์', 'บุญจะรักษ์', 'กองบริหารงานคณะ', 'สีม่วง', 'วอลเล่บอล', '02/04/23', '15:00 - 17:00', 'โรงยิม'),
(144, 'นาย', 'อิทธิพงศ์', 'โคแก้ว', 'กองบริหารงานคณะ', 'สีม่วง', 'วอลเล่บอล', '02/04/23', '15:00 - 17:00', 'โรงยิม'),
(145, 'นาย', 'สุภวัฒน์', 'คันทะพรม', 'กองบริหารงานคณะ', 'สีม่วง', 'วอลเล่บอล', '02/04/23', '15:00 - 17:00', 'โรงยิม'),
(146, 'นางสาว', 'นิรมล ', 'ภูครองนาค', 'กองบริหารงานคณะ', 'สีม่วง', 'วอลเล่บอล', '02/04/23', '15:00 - 17:00', 'โรงยิม'),
(147, 'นาย', 'สำราญ', 'ศรีโสภา', 'กองบริหารงานคณะ', 'สีม่วง', 'วอลเล่บอล', '02/04/23', '15:00 - 17:00', 'โรงยิม'),
(148, 'นางสาว', 'ศิวาการ', 'ชัชมนมาศ', 'กองบริหารงานคณะ', 'สีม่วง', 'วอลเล่บอล', '02/04/23', '15:00 - 17:00', 'โรงยิม'),
(149, 'นางสาว', 'ณัฐธิดา', 'ทึนรถ', 'กองบริหารงานคณะ', 'สีม่วง', 'วอลเล่บอล', '02/04/23', '15:00 - 17:00', 'โรงยิม'),
(150, 'นางสาว', 'ธิดารัตน์', 'บุตรราช', 'สาขาวิชาวิศวกรรมอุตสาหการ', 'สีม่วง', 'วอลเล่บอล', '02/04/23', '15:00 - 17:00', 'โรงยิม'),
(151, 'นาย', 'พิพัฒน์พงศ์', 'พันธุ์รัตน์', 'กองบริหารงานคณะ', 'สีม่วง', 'วอลเล่บอล', '02/04/23', '15:00 - 17:00', 'โรงยิม'),
(152, 'นางสาว', 'วันทนีย์ ', 'นาคะผิว', 'สาขาวิชาวิศวกรรมโยธา', 'สีม่วง', 'วอลเล่บอล', '02/04/23', '15:00 - 17:00', 'โรงยิม'),
(153, 'นางสาว', 'นันทวรรณ', 'ชาญวิชา', 'กองบริหารงานคณะ', 'สีม่วง', 'วอลเล่บอล', '02/04/23', '15:00 - 17:00', 'โรงยิม'),
(154, 'นาง', 'หนูเตียน', 'จันเล', 'กองบริหารงานคณะ', 'สีม่วง', 'วอลเล่บอล', '02/04/23', '15:00 - 17:00', 'โรงยิม'),
(155, 'นางสาว', 'ณัฎฐา ', 'ศักดิ์ศิลาพร', 'กองบริหารงานคณะ', 'สีม่วง', 'วอลเล่บอล', '02/04/23', '15:00 - 17:00', 'โรงยิม'),
(156, 'นางสาว', 'สุกฤตา', 'มหาหิง', 'กองบริหารงานคณะ', 'สีม่วง', 'วอลเล่บอล', '02/04/23', '15:00 - 17:00', 'โรงยิม'),
(157, 'นางสาว', 'อัมพร', 'บัวเริง', 'กองบริหารงานคณะ', 'สีม่วง', 'วอลเล่บอล', '02/04/23', '15:00 - 17:00', 'โรงยิม'),
(158, 'นางสาว', 'บงกช', 'ผาสุข', 'กองบริหารงานคณะ', 'สีม่วง', 'ปิงปอง', '02/04/23', '15:00 - 16:00', 'สนามปิงปอง'),
(159, 'นางสาว', 'นันทรัตน์', 'จิตระการ', 'กองบริหารงานคณะ', 'สีม่วง', 'ปิงปอง', '02/04/23', '15:00 - 16:00', 'สนามปิงปอง'),
(160, 'นางสาว', 'มาริษา', 'นันสมบัติ', 'กองบริหารงานคณะ', 'สีม่วง', 'ปิงปอง', '02/04/23', '15:00 - 16:00', 'สนามปิงปอง'),
(161, 'นาง', 'จันทร์ศรี ', 'สำราญพิทักษ์', 'กองบริหารงานคณะ', 'สีม่วง', 'ปิงปอง', '02/04/23', '15:00 - 16:00', 'สนามปิงปอง'),
(162, 'นาย', 'วรการ', 'ฮุนตระกูล', 'สาขาวิชาวิศวกรรมเคมี', 'สีม่วง', 'ปิงปอง', '02/04/23', '15:00 - 16:00', 'สนามปิงปอง'),
(163, 'อาจารย์', 'สุรัตน์', 'ประมวลศักดิกุล', 'วิศวกรรมโยธา', 'สีแดง', 'อาจารย์', '-', '-', '-'),
(164, 'อาจารย์', 'ศุภกร', 'ติระพัฒน์', 'วิศวกรรมโยธา', 'สีแดง', 'อาจารย์', '-', '-', '-'),
(165, 'อาจารย์', 'อำพล ', 'วงศ์ษา', 'วิศวกรรมโยธา', 'สีแดง', 'อาจารย์', '-', '-', '-'),
(166, 'ผู้ช่วยศาสตราจารย์', 'กิตติเวช', 'ขันติยวิชัย', 'วิศวกรรมโยธา', 'สีแดง', 'อาจารย์', '-', '-', '-'),
(167, 'ผู้ช่วยศาสตราจารย์', 'รัตมณี', 'นันทสาร', 'วิศวกรรมโยธา', 'สีแดง', 'อาจารย์', '-', '-', '-'),
(168, 'ผู้ช่วยศาสตราจารย์', 'ดลฤดี', 'หอมดี', 'วิศวกรรมโยธา', 'สีแดง', 'อาจารย์', '-', '-', '-'),
(169, 'ผู้ช่วยศาสตราจารย์', 'ชาติชาย', 'ไวยสุระสิงห์', 'วิศวกรรมโยธา', 'สีแดง', 'อาจารย์', '-', '-', '-'),
(170, 'ผู้ช่วยศาสตราจารย์', 'ปิยะวัชร', 'ฝอยทอง', 'วิศวกรรมโยธา', 'สีแดง', 'อาจารย์', '-', '-', '-'),
(171, 'ผู้ช่วยศาสตราจารย์', 'พีร์นิธิ', 'อักษร', 'วิศวกรรมโยธา', 'สีแดง', 'อาจารย์', '-', '-', '-'),
(172, 'รองศาสตราจารย์', 'วีระ', 'หอสกุลไท', 'วิศวกรรมโยธา', 'สีแดง', 'อาจารย์', '-', '-', '-'),
(173, 'รองศาสตราจารย์', 'พนกฤษณ', 'คลังบุญครอง', 'วิศวกรรมโยธา', 'สีแดง', 'อาจารย์', '-', '-', '-'),
(174, 'รองศาสตราจารย์', 'เฉลิมชัย', 'พาวัฒนา', 'วิศวกรรมโยธา', 'สีแดง', 'อาจารย์', '-', '-', '-'),
(175, 'รองศาสตราจารย์', 'จารึก', 'ถีระวงษ์', 'วิศวกรรมโยธา', 'สีแดง', 'อาจารย์', '-', '-', '-'),
(176, 'รองศาสตราจารย์', 'พงศกร', 'พรรณรัตนศิลป์', 'วิศวกรรมโยธา', 'สีแดง', 'อาจารย์', '-', '-', '-'),
(177, 'รองศาสตราจารย์', 'ณัฐพงษ์', 'อารีมิตร', 'วิศวกรรมโยธา', 'สีแดง', 'อาจารย์', '-', '-', '-'),
(178, 'รองศาสตราจารย์', 'เมธี', 'บุญพิเชฐวงศ์', 'วิศวกรรมโยธา', 'สีแดง', 'อาจารย์', '-', '-', '-'),
(179, 'รองศาสตราจารย์', 'ธันยดา', 'พรรณเชษฐ์', 'วิศวกรรมโยธา', 'สีแดง', 'อาจารย์', '-', '-', '-'),
(180, 'รองศาสตราจารย์', 'ลัดดา', 'ตันวาณิชกุล', 'วิศวกรรมโยธา', 'สีแดง', 'อาจารย์', '-', '-', '-'),
(181, 'รองศาสตราจารย์', 'ธเนศ', 'เสถียรนาม', 'วิศวกรรมโยธา', 'สีแดง', 'อาจารย์', '-', '-', '-'),
(182, 'รองศาสตราจารย์', 'กอปร', 'ศรีนาวิน', 'วิศวกรรมโยธา', 'สีแดง', 'อาจารย์', '-', '-', '-'),
(183, 'รองศาสตราจารย์', 'วันชัย', 'สะตะ', 'วิศวกรรมโยธา', 'สีแดง', 'อาจารย์', '-', '-', '-'),
(184, 'รองศาสตราจารย์', 'วิชุดา', 'เสถียรนาม', 'วิศวกรรมโยธา', 'สีแดง', 'อาจารย์', '-', '-', '-'),
(185, 'ศาสตราจารย์', 'ปริญญา', 'จินดาประเสริฐ', 'วิศวกรรมโยธา', 'สีแดง', 'อาจารย์', '-', '-', '-'),
(186, 'อาจารย์', 'สถิรพร', 'พรนิมิตร', 'วิศวกรรมไฟฟ้า', 'สีแดง', 'อาจารย์', '-', '-', '-'),
(187, 'อาจารย์', 'สงวน', 'บุญปัญญารักษ์', 'วิศวกรรมไฟฟ้า', 'สีแดง', 'อาจารย์', '-', '-', '-'),
(188, 'อาจารย์', 'จงกฤษฏิ์ ', 'จงอุดมการณ์', 'วิศวกรรมไฟฟ้า', 'สีแดง', 'อาจารย์', '-', '-', '-'),
(189, 'อาจารย์', 'ธนวุฒิ', 'ตันติโสภารักษ์', 'วิศวกรรมไฟฟ้า', 'สีแดง', 'อาจารย์', '-', '-', '-'),
(190, 'ผู้ช่วยศาสตราจารย์', 'อนุชา', 'แสงรุ่ง', 'วิศวกรรมไฟฟ้า', 'สีแดง', 'อาจารย์', '-', '-', '-'),
(191, 'ผู้ช่วยศาสตราจารย์', 'นิยม', 'พินิจการ', 'วิศวกรรมไฟฟ้า', 'สีแดง', 'อาจารย์', '-', '-', '-'),
(192, 'ผู้ช่วยศาสตราจารย์', 'ปานหทัย', 'บัวศรี', 'วิศวกรรมไฟฟ้า', 'สีฟ้า', 'อาจารย์', '-', '-', '-'),
(193, 'ผู้ช่วยศาสตราจารย์', 'ประมินทร์', 'อาจฤทธิ์', 'วิศวกรรมไฟฟ้า', 'สีฟ้า', 'อาจารย์', '-', '-', '-'),
(194, 'ผู้ช่วยศาสตราจารย์', 'บุญยิ่ง', 'เจริญ', 'วิศวกรรมไฟฟ้า', 'สีฟ้า', 'อาจารย์', '-', '-', '-'),
(195, 'ผู้ช่วยศาสตราจารย์', 'กิตติพิชญ์', 'มีสวาสดิ์', 'วิศวกรรมไฟฟ้า', 'สีฟ้า', 'อาจารย์', '-', '-', '-'),
(196, 'ผู้ช่วยศาสตราจารย์', 'นภัสถ์', 'ไตรโรจน์', 'วิศวกรรมไฟฟ้า', 'สีฟ้า', 'อาจารย์', '-', '-', '-'),
(197, 'ผู้ช่วยศาสตราจารย์', 'นรารัตน์', 'เรืองชัยจตุพร', 'วิศวกรรมไฟฟ้า', 'สีฟ้า', 'อาจารย์', '-', '-', '-'),
(198, 'ผู้ช่วยศาสตราจารย์', 'วรายุทธ ', 'คัมภีราวัฒน์', 'วิศวกรรมไฟฟ้า', 'สีฟ้า', 'อาจารย์', '-', '-', '-'),
(199, 'ผู้ช่วยศาสตราจารย์', 'ภูริพงศ์  ', 'สุทธิโสภาพันธ์', 'วิศวกรรมไฟฟ้า', 'สีฟ้า', 'อาจารย์', '-', '-', '-'),
(200, 'ผู้ช่วยศาสตราจารย์', 'พิรัสม์', 'คุณกิตติ', 'วิศวกรรมไฟฟ้า', 'สีฟ้า', 'อาจารย์', '-', '-', '-'),
(201, 'ผู้ช่วยศาสตราจารย์', 'รองฤทธิ์', 'ฉัตรถาวร', 'วิศวกรรมไฟฟ้า', 'สีฟ้า', 'อาจารย์', '-', '-', '-'),
(202, 'รองศาสตราจารย์', 'วิระสิทธิ์', 'อิ่มถวิล', 'วิศวกรรมไฟฟ้า', 'สีฟ้า', 'อาจารย์', '-', '-', '-'),
(203, 'รองศาสตราจารย์', 'อาคม', 'แก้วระวัง', 'วิศวกรรมไฟฟ้า', 'สีฟ้า', 'อาจารย์', '-', '-', '-'),
(204, 'รองศาสตราจารย์', 'กฤษ', 'เฉยไสย', 'วิศวกรรมไฟฟ้า', 'สีฟ้า', 'อาจารย์', '-', '-', '-'),
(205, 'รองศาสตราจารย์', 'จีรนุช', 'เสงี่ยมศักดิ์', 'วิศวกรรมไฟฟ้า', 'สีฟ้า', 'อาจารย์', '-', '-', '-'),
(206, 'รองศาสตราจารย์', 'อำนาจ', 'สุขศรี', 'วิศวกรรมไฟฟ้า', 'สีฟ้า', 'อาจารย์', '-', '-', '-'),
(207, 'รองศาสตราจารย์', 'อานุภาพ', 'มีสมบูรณ์', 'วิศวกรรมไฟฟ้า', 'สีฟ้า', 'อาจารย์', '-', '-', '-'),
(208, 'รองศาสตราจารย์', 'อนันต์', 'เครือทรัพย์ถาวร', 'วิศวกรรมไฟฟ้า', 'สีฟ้า', 'อาจารย์', '-', '-', '-'),
(209, 'รองศาสตราจารย์', 'ศราวุธ', 'ชัยมูล', 'วิศวกรรมไฟฟ้า', 'สีฟ้า', 'อาจารย์', '-', '-', '-'),
(210, 'ศาสตราจารย์', 'อภิรัฐ', 'ศิริธราธิวัตร', 'วิศวกรรมไฟฟ้า', 'สีฟ้า', 'อาจารย์', '-', '-', '-'),
(211, 'ผู้ช่วยศาสตราจารย์', 'คำนึง', 'วาทโยธา', 'วิศวกรรมเกษตร', 'สีฟ้า', 'อาจารย์', '-', '-', '-'),
(212, 'ผู้ช่วยศาสตราจารย์', 'โพยม', 'สราภิรมย์', 'วิศวกรรมเกษตร', 'สีฟ้า', 'อาจารย์', '-', '-', '-'),
(213, 'ผู้ช่วยศาสตราจารย์', 'กิตติพงษ์', 'ลาลุน', 'วิศวกรรมเกษตร', 'สีฟ้า', 'อาจารย์', '-', '-', '-'),
(214, 'ผู้ช่วยศาสตราจารย์', 'เจษฎา ', 'โพธิ์สม', 'วิศวกรรมเกษตร', 'สีฟ้า', 'อาจารย์', '-', '-', '-'),
(215, 'รองศาสตราจารย์', 'สมชาย', 'ชวนอุดม', 'วิศวกรรมเกษตร', 'สีฟ้า', 'อาจารย์', '-', '-', '-'),
(216, 'รองศาสตราจารย์', 'ศุภสิทธิ์', 'คนใหญ่', 'วิศวกรรมเกษตร', 'สีฟ้า', 'อาจารย์', '-', '-', '-'),
(217, 'รองศาสตราจารย์', 'ชัยยันต์', 'จันทร์ศิริ', 'วิศวกรรมเกษตร', 'สีฟ้า', 'อาจารย์', '-', '-', '-'),
(218, 'รองศาสตราจารย์', 'ขวัญตรี', 'แสงประชาธนารักษ์', 'วิศวกรรมเกษตร', 'สีฟ้า', 'อาจารย์', '-', '-', '-'),
(219, 'อาจารย์', 'ศิโรรัตน์ ', 'พัฒนไพโรจน์', 'วิศวกรรมอุตสาหการ', 'สีฟ้า', 'อาจารย์', '-', '-', '-'),
(220, 'อาจารย์', 'กฤษณรัช', 'นิติสิริ', 'วิศวกรรมอุตสาหการ', 'สีฟ้า', 'อาจารย์', '-', '-', '-'),
(221, 'ผู้ช่วยศาสตราจารย์', 'วีรพัฒน์', 'เศรษฐ์สมบูรณ์', 'วิศวกรรมอุตสาหการ', 'สีฟ้า', 'อาจารย์', '-', '-', '-'),
(222, 'ผู้ช่วยศาสตราจารย์', 'ศิรวดี', 'อรัญนารถ', 'วิศวกรรมอุตสาหการ', 'สีฟ้า', 'อาจารย์', '-', '-', '-'),
(223, 'ผู้ช่วยศาสตราจารย์', 'ฐิติพงศ์', 'จำรัส', 'วิศวกรรมอุตสาหการ', 'สีฟ้า', 'อาจารย์', '-', '-', '-'),
(224, 'ผู้ช่วยศาสตราจารย์', 'ธีรวัฒน์', 'เหล่านภากุล', 'วิศวกรรมอุตสาหการ', 'สีฟ้า', 'อาจารย์', '-', '-', '-'),
(225, 'ผู้ช่วยศาสตราจารย์', 'อภิชาติ', 'บุญมา', 'วิศวกรรมอุตสาหการ', 'สีฟ้า', 'อาจารย์', '-', '-', '-'),
(226, 'ผู้ช่วยศาสตราจารย์', 'สุขอังคณา', 'แถลงกัณฑ์', 'วิศวกรรมอุตสาหการ', 'สีฟ้า', 'อาจารย์', '-', '-', '-'),
(227, 'ผู้ช่วยศาสตราจารย์', 'คมกฤช ', 'ปิติฤกษ์', 'วิศวกรรมอุตสาหการ', 'สีฟ้า', 'อาจารย์', '-', '-', '-'),
(228, 'ผู้ช่วยศาสตราจารย์', 'ทวี', 'นาครัชตะอมร', 'วิศวกรรมอุตสาหการ', 'สีฟ้า', 'อาจารย์', '-', '-', '-'),
(229, 'ผู้ช่วยศาสตราจารย์', 'ปนิทัศน์ ', 'สุรียธนาภาส', 'วิศวกรรมอุตสาหการ', 'สีฟ้า', 'อาจารย์', '-', '-', '-'),
(230, 'ผู้ช่วยศาสตราจารย์', 'ฐนวรรธน์', 'นิยะโมสถ', 'วิศวกรรมอุตสาหการ', 'สีฟ้า', 'อาจารย์', '-', '-', '-'),
(231, 'รองศาสตราจารย์', 'ชาญณรงค์', 'สายแก้ว', 'วิศวกรรมอุตสาหการ', 'สีฟ้า', 'อาจารย์', '-', '-', '-'),
(232, 'รองศาสตราจารย์', 'ปณิธาน', 'พีรพัฒนา', 'วิศวกรรมอุตสาหการ', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(233, 'รองศาสตราจารย์', 'พรเทพ', 'ขอขจายเกียรติ', 'วิศวกรรมอุตสาหการ', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(234, 'รองศาสตราจารย์', 'ดนัยพงศ์', 'เชษฐโชติศักดิ์', 'วิศวกรรมอุตสาหการ', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(235, 'รองศาสตราจารย์', 'รักน้อย', 'อัครรุ่งเรืองกุล', 'วิศวกรรมอุตสาหการ', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(236, 'รองศาสตราจารย์', 'ธนา', 'ราษฎร์ภักดี', 'วิศวกรรมอุตสาหการ', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(237, 'รองศาสตราจารย์', 'ศีขรินทร์', 'สุขโต', 'วิศวกรรมอุตสาหการ', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(238, 'รองศาสตราจารย์', 'ปาพจน์', 'เจริญอภิบาล', 'วิศวกรรมอุตสาหการ', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(239, 'ศาสตราจารย์', 'กาญจนา', 'เศรษฐนันท์', 'วิศวกรรมอุตสาหการ', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(240, 'อาจารย์', 'จิตติน', 'ตรีพุทธรัตน์', 'วิศวกรรมเครื่องกล', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(241, 'อาจารย์', 'ทรงศักดิ์', 'สุวรรณศรี', 'วิศวกรรมเครื่องกล', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(242, 'อาจารย์', 'จารุพล', 'สุริยวนากุล', 'วิศวกรรมเครื่องกล', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(243, 'อาจารย์', 'นที ', 'พนากานต์', 'วิศวกรรมเครื่องกล', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(244, 'อาจารย์', 'วศกร ', 'ตรีเดช', 'วิศวกรรมเครื่องกล', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(245, 'ผู้ช่วยศาสตราจารย์', 'อัญชลี', 'แสงซ้าย', 'วิศวกรรมเครื่องกล', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(246, 'ผู้ช่วยศาสตราจารย์', 'ชนกนันท์', 'สุขกำเนิด', 'วิศวกรรมเครื่องกล', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(247, 'ผู้ช่วยศาสตราจารย์', 'เด่นพงษ์', 'สุดภักดี', 'วิศวกรรมเครื่องกล', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(248, 'ผู้ช่วยศาสตราจารย์', 'ปิโยรส', 'จิระวัฒนา', 'วิศวกรรมเครื่องกล', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(249, 'ผู้ช่วยศาสตราจารย์', 'เขมจิต', 'เสนา', 'วิศวกรรมเครื่องกล', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(250, 'ผู้ช่วยศาสตราจารย์', 'จุฬาภรณ์', 'เบญจปิยะพร', 'วิศวกรรมเครื่องกล', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(251, 'ผู้ช่วยศาสตราจารย์', 'ฉัตรชัย', 'เบญจปิยะพร', 'วิศวกรรมเครื่องกล', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(252, 'ผู้ช่วยศาสตราจารย์', 'อัครพล', 'จันทร์อ่อน', 'วิศวกรรมเครื่องกล', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(253, 'ผู้ช่วยศาสตราจารย์', 'นำพล', 'มหายศนันท์', 'วิศวกรรมเครื่องกล', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(254, 'รองศาสตราจารย์', 'อนุสรณ์', 'ชินสุวรรณ', 'วิศวกรรมเครื่องกล', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(255, 'รองศาสตราจารย์', 'เกียรติฟ้า', 'ตั้งใจจิต', 'วิศวกรรมเครื่องกล', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(256, 'รองศาสตราจารย์', 'รัชพล', 'สันติวรากร', 'วิศวกรรมเครื่องกล', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(257, 'รองศาสตราจารย์', 'สุรสิทธิ์', 'ปิยะศิลป์', 'วิศวกรรมเครื่องกล', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(258, 'รองศาสตราจารย์', 'ณัญธิวัฒน์', 'พลดี', 'วิศวกรรมเครื่องกล', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(259, 'ศาสตราจารย์', 'สุจินต์', 'บุรีรัตน์', 'วิศวกรรมเครื่องกล', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(260, 'ศาสตราจารย์', 'ธนากร', 'วงศ์วัฒนาเสถียร', 'วิศวกรรมเครื่องกล', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(261, 'อาจารย์', 'ชัชวาล', 'อัยยาธิติ', 'วิศวกรรมสิ่งแวดล้อม', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(262, 'อาจารย์', 'ปณิธาน', 'จูฑาพร', 'วิศวกรรมสิ่งแวดล้อม', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(263, 'อาจารย์', 'รัฐบาล', 'ขันธ์โพธิ์น้อย', 'วิศวกรรมสิ่งแวดล้อม', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(264, 'อาจารย์', 'พันวัตต์ ', 'พึ่งสาย', 'วิศวกรรมสิ่งแวดล้อม', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(265, 'ผู้ช่วยศาสตราจารย์', 'อาวุธ', 'ยิ้มแต้', 'วิศวกรรมสิ่งแวดล้อม', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(266, 'ผู้ช่วยศาสตราจารย์', 'พนมชัย', 'วีระยุทธศิลป์', 'วิศวกรรมสิ่งแวดล้อม', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(267, 'ผู้ช่วยศาสตราจารย์', 'ธัญลักษณ์ ', 'ราษฎร์ภักดี', 'วิศวกรรมสิ่งแวดล้อม', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(268, 'ผู้ช่วยศาสตราจารย์', 'วิษณุ ', 'แทนบุญช่วย', 'วิศวกรรมสิ่งแวดล้อม', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(269, 'รองศาสตราจารย์', 'ไปรยา', 'เฉยไสย', 'วิศวกรรมสิ่งแวดล้อม', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(270, 'รองศาสตราจารย์', 'กัลยกร', 'ขวัญมา', 'วิศวกรรมสิ่งแวดล้อม', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(271, 'รองศาสตราจารย์', 'สุมนา', 'ราษฎร์ภักดี', 'วิศวกรรมสิ่งแวดล้อม', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(272, 'รองศาสตราจารย์', 'สุรพล', 'ผดุงทน', 'วิศวกรรมสิ่งแวดล้อม', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(273, 'อาจารย์', 'ทินกร', 'คำแสน', 'วิศวกรรมเคมี', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(274, 'อาจารย์', 'อธิป', 'เหลืองไพโรจน์', 'วิศวกรรมเคมี', 'สีเขียว', 'อาจารย์', '-', '-', '-'),
(275, 'อาจารย์', 'อรณัฐ', 'ชูชื่น', 'วิศวกรรมเคมี', 'สีม่วง', 'อาจารย์', '-', '-', '-'),
(276, 'ผู้ช่วยศาสตราจารย์', 'วรินรำไพ', 'เศรษฐ์ธณบุตร', 'วิศวกรรมเคมี', 'สีม่วง', 'อาจารย์', '-', '-', '-'),
(277, 'ผู้ช่วยศาสตราจารย์', 'อภิชาติ', 'อาจนาเสียว', 'วิศวกรรมเคมี', 'สีม่วง', 'อาจารย์', '-', '-', '-'),
(278, 'ผู้ช่วยศาสตราจารย์', 'พนมกร', 'ขวาของ', 'วิศวกรรมเคมี', 'สีม่วง', 'อาจารย์', '-', '-', '-'),
(279, 'ผู้ช่วยศาสตราจารย์', 'ยุวรัตน์', 'เงินเย็น', 'วิศวกรรมเคมี', 'สีม่วง', 'อาจารย์', '-', '-', '-'),
(280, 'ผู้ช่วยศาสตราจารย์', 'แก้วตา', 'เจตศรีสุภาพ', 'วิศวกรรมเคมี', 'สีม่วง', 'อาจารย์', '-', '-', '-'),
(281, 'ผู้ช่วยศาสตราจารย์', 'ดวงกนก ', 'ธนังธีรพงษ์', 'วิศวกรรมเคมี', 'สีม่วง', 'อาจารย์', '-', '-', '-'),
(282, 'รองศาสตราจารย์', 'ชัยภัทร', 'เครือหงส์', 'วิศวกรรมเคมี', 'สีม่วง', 'อาจารย์', '-', '-', '-'),
(283, 'รองศาสตราจารย์', 'อาทิตย์', 'เนรมิตตกพงศ์', 'วิศวกรรมเคมี', 'สีม่วง', 'อาจารย์', '-', '-', '-'),
(284, 'รองศาสตราจารย์', 'กันยรัตน์', 'โหละสุต', 'วิศวกรรมเคมี', 'สีม่วง', 'อาจารย์', '-', '-', '-'),
(285, 'รองศาสตราจารย์', 'สุธาสินี', 'เนรมิตตกพงศ์', 'วิศวกรรมเคมี', 'สีม่วง', 'อาจารย์', '-', '-', '-'),
(286, 'รองศาสตราจารย์', 'ขนิษฐา', 'คำวิลัยศักดิ์', 'วิศวกรรมเคมี', 'สีม่วง', 'อาจารย์', '-', '-', '-'),
(287, 'รองศาสตราจารย์', 'กิติโรจน์ ', 'หวันตาหลา', 'วิศวกรรมเคมี', 'สีม่วง', 'อาจารย์', '-', '-', '-'),
(288, 'รองศาสตราจารย์', 'พรนภา ', 'เกษมศิริ', 'วิศวกรรมเคมี', 'สีม่วง', 'อาจารย์', '-', '-', '-'),
(289, 'อาจารย์', 'วสุ', 'เชาว์พานนท์', 'วิศวกรรมคอมพิวเตอร์', 'สีม่วง', 'อาจารย์', '-', '-', '-'),
(290, 'อาจารย์', 'นวภัค', 'เอื้ออนันต์', 'วิศวกรรมคอมพิวเตอร์', 'สีม่วง', 'อาจารย์', '-', '-', '-'),
(291, 'อาจารย์', 'วาธิส', 'ลีลาภัทร', 'วิศวกรรมคอมพิวเตอร์', 'สีม่วง', 'อาจารย์', '-', '-', '-'),
(292, 'อาจารย์', 'กิตติ์', 'เธียรธโนปจัย', 'วิศวกรรมคอมพิวเตอร์', 'สีม่วง', 'อาจารย์', '-', '-', '-'),
(293, 'อาจารย์', 'ชวิศ ', 'ศรีจันทร์', 'วิศวกรรมคอมพิวเตอร์', 'สีม่วง', 'อาจารย์', '-', '-', '-'),
(294, 'ผู้ช่วยศาสตราจารย์', 'ชัชชัย', 'คุณบัว', 'วิศวกรรมคอมพิวเตอร์', 'สีม่วง', 'อาจารย์', '-', '-', '-'),
(295, 'ผู้ช่วยศาสตราจารย์', 'วิชชา', 'เฟื่องจันทร์', 'วิศวกรรมคอมพิวเตอร์', 'สีม่วง', 'อาจารย์', '-', '-', '-'),
(296, 'ผู้ช่วยศาสตราจารย์', 'จิระเดช', 'พลสวัสดิ์', 'วิศวกรรมคอมพิวเตอร์', 'สีม่วง', 'อาจารย์', '-', '-', '-'),
(297, 'ผู้ช่วยศาสตราจารย์', 'ภาณุพงษ์', 'วันจันทึก', 'วิศวกรรมคอมพิวเตอร์', 'สีม่วง', 'อาจารย์', '-', '-', '-'),
(298, 'ผู้ช่วยศาสตราจารย์', 'อนัตต์', 'เจ่าสกุล', 'วิศวกรรมคอมพิวเตอร์', 'สีม่วง', 'อาจารย์', '-', '-', '-'),
(299, 'ผู้ช่วยศาสตราจารย์', 'ดารณี', 'หอมดี', 'วิศวกรรมคอมพิวเตอร์', 'สีม่วง', 'อาจารย์', '-', '-', '-'),
(300, 'ผู้ช่วยศาสตราจารย์', 'ภัทรวิทย์', 'พลพินิจ', 'วิศวกรรมคอมพิวเตอร์', 'สีม่วง', 'อาจารย์', '-', '-', '-'),
(301, 'ผู้ช่วยศาสตราจารย์', 'กรชวัล', 'ชายผา', 'วิศวกรรมคอมพิวเตอร์', 'สีม่วง', 'อาจารย์', '-', '-', '-'),
(302, 'รองศาสตราจารย์', 'วนิดา', 'แก่นอากาศ', 'วิศวกรรมคอมพิวเตอร์', 'สีม่วง', 'อาจารย์', '-', '-', '-'),
(303, 'รองศาสตราจารย์', 'กานดา', 'สายแก้ว', 'วิศวกรรมคอมพิวเตอร์', 'สีม่วง', 'อาจารย์', '-', '-', '-'),
(304, 'รองศาสตราจารย์', 'พิเชษฐ', 'เชี่ยวธนะกุล', 'วิศวกรรมคอมพิวเตอร์', 'สีม่วง', 'อาจารย์', '-', '-', '-'),
(305, 'รองศาสตราจารย์', 'วิโรจน์', 'ทวีปวรเดช', 'วิศวกรรมคอมพิวเตอร์', 'สีม่วง', 'อาจารย์', '-', '-', '-'),
(306, 'รองศาสตราจารย์', 'ธัชพงศ์ ', 'กตัญญูกุล', 'วิศวกรรมคอมพิวเตอร์', 'สีม่วง', 'อาจารย์', '-', '-', '-'),
(307, 'นาย', 'ภาคภูมิ', 'อริกพันธุ์', 'โครงการพัฒนาทักษะการเรียนรู้แบบบูรณาการ', 'สีแดง', 'ศูนย์ต่างๆ', '-', '-', '-'),
(308, 'นางสาว', 'เมตตา', 'บัวพันธ์', 'โครงการพัฒนาทักษะการเรียนรู้แบบบูรณาการ', 'สีแดง', 'ศูนย์ต่างๆ', '-', '-', '-'),
(309, 'นางสาว', 'ณัฐพร', 'ชบา', 'โครงการพัฒนาทักษะการเรียนรู้แบบบูรณาการ', 'สีแดง', 'ศูนย์ต่างๆ', '-', '-', '-'),
(310, 'นางสาว', 'สุทธิชา', 'ปะโอปตินัง', 'โครงการพัฒนาทักษะการเรียนรู้แบบบูรณาการ', 'สีแดง', 'ศูนย์ต่างๆ', '-', '-', '-'),
(311, 'นางสาว', 'วิริยา ', 'ส่วยลี', 'ศูนย์วิจัยเครื่องจักรกลเกษตรและวิทยาการหลังการเก็บเกี่ยว', 'สีแดง', 'ศูนย์ต่างๆ', '-', '-', '-'),
(312, 'นางสาว', 'พิมพ์พจี', 'บางประอินทร์', 'ศูนย์วิจัยเครื่องจักรกลเกษตรและวิทยาการหลังการเก็บเกี่ยว', 'สีแดง', 'ศูนย์ต่างๆ', '-', '-', '-'),
(313, 'นาย', 'ศักดิ์ดา', 'จำปานา', 'ศูนย์วิจัยเครื่องจักรกลเกษตรและวิทยาการหลังการเก็บเกี่ยว', 'สีแดง', 'ศูนย์ต่างๆ', '-', '-', '-'),
(314, 'นาย', 'ณัฐพล ', 'โสกุดเลา', 'ศูนย์วิจัยเครื่องจักรกลเกษตรและวิทยาการหลังการเก็บเกี่ยว', 'สีฟ้า', 'ศูนย์ต่างๆ', '-', '-', '-'),
(315, 'นาย', 'พีรณัฐ', 'อัญสุรีย์', 'ศูนย์วิจัยเครื่องจักรกลเกษตรและวิทยาการหลังการเก็บเกี่ยว', 'สีฟ้า', 'ศูนย์ต่างๆ', '-', '-', '-'),
(316, 'นาย', 'กันตพงษ์', 'แข้โส', 'ศูนย์วิจัยเครื่องจักรกลเกษตรและวิทยาการหลังการเก็บเกี่ยว', 'สีฟ้า', 'ศูนย์ต่างๆ', '-', '-', '-'),
(317, 'นาย', 'อภิวิชญ์', 'หาญพิชาญชัย', 'ศูนย์วิจัยเครื่องจักรกลเกษตรและวิทยาการหลังการเก็บเกี่ยว', 'สีฟ้า', 'ศูนย์ต่างๆ', '-', '-', '-'),
(318, 'นาย', 'อนันต์', 'จันที', 'ศูนย์วิจัยเครื่องจักรกลเกษตรและวิทยาการหลังการเก็บเกี่ยว', 'สีฟ้า', 'ศูนย์ต่างๆ', '-', '-', '-'),
(319, 'นาย', 'ธีระพงษ์', 'แสงวิชัย', 'ศูนย์วิจัยเครื่องจักรกลเกษตรและวิทยาการหลังการเก็บเกี่ยว', 'สีฟ้า', 'ศูนย์ต่างๆ', '-', '-', '-'),
(320, 'นางสาว', 'วรุณพร', 'ดวงใจ', 'ศูนย์วิจัยด้านการจัดการสิ่งแวดล้อมและสารอันตราย', 'สีฟ้า', 'ศูนย์ต่างๆ', '-', '-', '-'),
(321, 'นางสาว', 'ศรีรัตน์', 'สุวรรณคม', 'ศูนย์วิจัยด้านการจัดการสิ่งแวดล้อมและสารอันตราย', 'สีเขียว', 'ศูนย์ต่างๆ', '-', '-', '-'),
(322, 'นาย', 'นครินทร์', 'เทอดเกียรติกุล', 'ศูนย์วิจัยด้านการจัดการสิ่งแวดล้อมและสารอันตราย', 'สีเขียว', 'ศูนย์ต่างๆ', '-', '-', '-'),
(323, 'นางสาว', 'กัญญาภัค', 'สมปัญญา', 'ศูนย์วิจัยด้านการจัดการสิ่งแวดล้อมและสารอันตราย', 'สีเขียว', 'ศูนย์ต่างๆ', '-', '-', '-'),
(324, 'ดร.', 'ศุภวรรณ', 'ขันโททอง', 'ศูนย์การจัดการสิ่งแวดล้อม', 'สีเขียว', 'ศูนย์ต่างๆ', '-', '-', '-'),
(325, 'นางสาว', 'นลินรัตน์', 'เครือทองศรี', 'ศูนย์การจัดการสิ่งแวดล้อม', 'สีเขียว', 'ศูนย์ต่างๆ', '-', '-', '-'),
(326, 'นาง', 'เจนจิรา', 'มะโนชมภู', 'ศูนย์การจัดการสิ่งแวดล้อม', 'สีเขียว', 'ศูนย์ต่างๆ', '-', '-', '-'),
(327, 'นาง', 'เพชราภรณ์', 'ภูครองตา', 'ศูนย์การจัดการสิ่งแวดล้อม', 'สีเขียว', 'ศูนย์ต่างๆ', '-', '-', '-'),
(328, 'นางสาว', 'สุวรรณา', 'วงษ์จันทอง', 'ศูนย์การจัดการสิ่งแวดล้อม', 'สีม่วง', 'ศูนย์ต่างๆ', '-', '-', '-'),
(329, 'นางสาว', 'ลลิตา', 'ประจักษ์รัตนกุล', 'ศูนย์การจัดการสิ่งแวดล้อม', 'สีม่วง', 'ศูนย์ต่างๆ', '-', '-', '-'),
(330, 'นางสาว', 'เบญจวรรณ', 'รวดเร็ว', 'ศูนย์การจัดการสิ่งแวดล้อม', 'สีม่วง', 'ศูนย์ต่างๆ', '-', '-', '-'),
(331, 'นาย', 'แสวง', 'แสนแก้ว', 'ศูนย์การจัดการสิ่งแวดล้อม', 'สีม่วง', 'ศูนย์ต่างๆ', '-', '-', '-'),
(332, 'นาย', 'สนอง', 'นามเบ้าโฮง', 'ศูนย์การจัดการสิ่งแวดล้อม', 'สีม่วง', 'ศูนย์ต่างๆ', '-', '-', '-'),
(333, 'นาย', 'สุริยะ', 'สรรพโส', 'ศูนย์การจัดการสิ่งแวดล้อม', 'สีม่วง', 'ศูนย์ต่างๆ', '-', '-', '-'),
(334, 'นาย', 'ศุภวิชญ์', 'วิไลลักษณ์', 'ศูนย์การจัดการสิ่งแวดล้อม', 'สีม่วง', 'ศูนย์ต่างๆ', '-', '-', '-');

-- --------------------------------------------------------

--
-- Table structure for table `time_table`
--

CREATE TABLE `time_table` (
  `ID` int(11) NOT NULL,
  `Date` varchar(50) DEFAULT NULL,
  `Time` varchar(50) DEFAULT NULL,
  `Sport` varchar(50) DEFAULT NULL,
  `Team1` varchar(50) DEFAULT NULL,
  `Team2` varchar(50) DEFAULT NULL,
  `Place` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `time_table`
--

INSERT INTO `time_table` (`ID`, `Date`, `Time`, `Sport`, `Team1`, `Team2`, `Place`) VALUES
(1, '01/04/23', '15:00 - 17:00', 'ฟุตบอล', 'สีแดง', 'สีฟ้า', 'สนามฟุตบอล'),
(2, '01/04/23', '15:00 - 17:00', 'วอลเล่บอล', 'สีเขียว', 'สีฟ้้า', 'โรงยิม'),
(3, '01/04/23', '15:00 - 16:00', 'ปิงปอง', 'สีแดง', 'สีเขียว', 'สนามปิงปอง'),
(4, '02/04/23', '15:00 - 17:00', 'ฟุตบอล', 'สีเขียว', 'สีม่วง', 'สนามฟุตบอล'),
(5, '02/04/23', '15:00 - 17:00', 'วอลเล่บอล', 'สีแดง', 'สีม่วง', 'โรงยิม'),
(6, '02/04/23', '15:00 - 16:00', 'ปิงปอง', 'สีม่วง', 'สีฟ้า', 'สนามปิงปอง'),
(7, '03/04/23', '15:00 - 17:00', 'ฟุตบอล', 'ผู้ชนะคู่ 1', 'ผู้ชนะคู่ 2', 'สนามฟุตบอล'),
(8, '03/04/23', '15:00 - 17:00', 'วอลเล่บอล', 'ผู้ชนะคู่ 1', 'ผู้ชนะคู่ 2', 'โรงยิม'),
(9, '03/04/23', '15:00 - 16:00', 'ปิงปอง', 'ผู้ชนะคู่ 1', 'ผู้ชนะคู่ 2', 'สนามปิงปอง');

-- --------------------------------------------------------

--
-- Table structure for table `user`
--

CREATE TABLE `user` (
  `id` int(11) NOT NULL,
  `username` varchar(100) NOT NULL,
  `email` varchar(100) NOT NULL,
  `password` varchar(100) NOT NULL,
  `role` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `user`
--

INSERT INTO `user` (`id`, `username`, `email`, `password`, `role`) VALUES
(3, 'admin', 'admin@admin.com', '21232f297a57a5a743894a0e4a801fc3', 'admin'),
(4, 'user1', 'user1@u.com', 'b59c67bf196a4758191e42f76670ceba', 'member'),
(5, 'user01', 'user01@ss.com', 'b59c67bf196a4758191e42f76670ceba', 'member'),
(6, 'test1', 'test1@dfa.com', 'b59c67bf196a4758191e42f76670ceba', 'member');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `name_list`
--
ALTER TABLE `name_list`
  ADD PRIMARY KEY (`ID`);

--
-- Indexes for table `time_table`
--
ALTER TABLE `time_table`
  ADD PRIMARY KEY (`ID`);

--
-- Indexes for table `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `time_table`
--
ALTER TABLE `time_table`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=16;

--
-- AUTO_INCREMENT for table `user`
--
ALTER TABLE `user`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
